amount of files used
validation split is set to 0.2

class neutral
amount 105000
class selection
amount 105000

model summary

Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 20, 50, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 19, 49, 32)        160       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 18, 48, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 17, 47, 32)        4128      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 46, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 45, 32)        4128      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 14, 44, 32)        0         
_________________________________________________________________
flatten (Flatten)            (None, 19712)             0         
_________________________________________________________________
dense (Dense)                (None, 32)                630816    
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 66        
=================================================================
Total params: 639,298
Trainable params: 639,298
Non-trainable params: 0
_________________________________________________________________
