amount of files used
validation split is set to 0.2

class neutral
amount 210000
class selection
amount 210000

model summary

Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 20, 50, 1)]       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 19, 49, 32)        160       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 18, 48, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 17, 47, 32)        4128      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 16, 46, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 15, 45, 32)        4128      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 14, 44, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 19712)             0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                630816    
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 66        
=================================================================
Total params: 639,298
Trainable params: 639,298
Non-trainable params: 0
_________________________________________________________________
